In [2]:
import pandas as pd
import numpy as np
string_data = pd.Series(['aardvark', 'artichoke', np.nan, 'avocado'])

In [3]:
string_data

0     aardvark
1    artichoke
2          NaN
3      avocado
dtype: object

In [5]:
string_data.notnull()

0     True
1     True
2    False
3     True
dtype: bool

In [14]:
from numpy import nan as NA
data = pd.Series([1, NA, 3.5, NA, 7])

In [7]:
data

0    1.0
1    NaN
2    3.5
3    NaN
4    7.0
dtype: float64

In [11]:
data.dropna(inplace = True)

In [12]:
data

0    1.0
2    3.5
4    7.0
dtype: float64

In [10]:
data

0    1.0
1    NaN
2    3.5
3    NaN
4    7.0
dtype: float64

In [13]:
data

0    1.0
2    3.5
4    7.0
dtype: float64

In [15]:
data

0    1.0
1    NaN
2    3.5
3    NaN
4    7.0
dtype: float64

In [16]:
data.fillna(0)

0    1.0
1    0.0
2    3.5
3    0.0
4    7.0
dtype: float64

In [17]:
data = pd.DataFrame([[1., 6.5, 3.], [1., NA, NA],
[NA, NA, NA], [NA, 6.5, 3.]])

In [18]:
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [25]:
data.fillna({1:0, 2: 1, 0: 3})

     0    1    2
0  1.0  6.5  3.0
1  1.0  0.0  1.0
2  3.0  0.0  1.0
3  3.0  6.5  3.0

In [27]:
data.dropna()

     0    1    2
0  1.0  6.5  3.0

In [29]:
data.dropna(how = "all")

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [31]:
data[4] = NA

In [33]:
data.dropna(how = "all", axis = 1)

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [34]:
df = pd.DataFrame(np.random.randn(7, 3))
df.iloc[:4, 1] = NA
df.iloc[:2, 2] = NA

In [35]:
df

          0         1         2
0  0.539272       NaN       NaN
1  0.828700       NaN       NaN
2  0.565848       NaN  1.761702
3 -0.683176       NaN  0.355287
4  0.445936 -0.005775 -0.017751
5  1.251529  1.715555 -0.923119
6  0.078109  0.617741 -0.283488

In [41]:
df.dropna(thresh = 2)

          0         1         2
2  0.565848       NaN  1.761702
3 -0.683176       NaN  0.355287
4  0.445936 -0.005775 -0.017751
5  1.251529  1.715555 -0.923119
6  0.078109  0.617741 -0.283488

In [43]:
df.fillna(0)

          0         1         2
0  0.539272  0.000000  0.000000
1  0.828700  0.000000  0.000000
2  0.565848  0.000000  1.761702
3 -0.683176  0.000000  0.355287
4  0.445936 -0.005775 -0.017751
5  1.251529  1.715555 -0.923119
6  0.078109  0.617741 -0.283488

In [44]:
df.fillna({1 : 5,2 : 9, 0 : 3})

          0         1         2
0  0.539272  5.000000  9.000000
1  0.828700  5.000000  9.000000
2  0.565848  5.000000  1.761702
3 -0.683176  5.000000  0.355287
4  0.445936 -0.005775 -0.017751
5  1.251529  1.715555 -0.923119
6  0.078109  0.617741 -0.283488

In [46]:
df.fillna(method = "ffill")

          0         1         2
0  0.539272       NaN       NaN
1  0.828700       NaN       NaN
2  0.565848       NaN  1.761702
3 -0.683176       NaN  0.355287
4  0.445936 -0.005775 -0.017751
5  1.251529  1.715555 -0.923119
6  0.078109  0.617741 -0.283488

In [47]:
df.fillna(method = "bfill")

          0         1         2
0  0.539272 -0.005775  1.761702
1  0.828700 -0.005775  1.761702
2  0.565848 -0.005775  1.761702
3 -0.683176 -0.005775  0.355287
4  0.445936 -0.005775 -0.017751
5  1.251529  1.715555 -0.923119
6  0.078109  0.617741 -0.283488

In [49]:
df.fillna(method = "bfill", limit = 2, inplace = True)

In [50]:
df

          0         1         2
0  0.539272       NaN  1.761702
1  0.828700       NaN  1.761702
2  0.565848 -0.005775  1.761702
3 -0.683176 -0.005775  0.355287
4  0.445936 -0.005775 -0.017751
5  1.251529  1.715555 -0.923119
6  0.078109  0.617741 -0.283488

In [51]:
df.fillna(df.mean())

          0         1         2
0  0.539272  0.463194  1.761702
1  0.828700  0.463194  1.761702
2  0.565848 -0.005775  1.761702
3 -0.683176 -0.005775  0.355287
4  0.445936 -0.005775 -0.017751
5  1.251529  1.715555 -0.923119
6  0.078109  0.617741 -0.283488

In [54]:
data = pd.DataFrame({'k1': ['one', 'two'] * 3 + ['two'], 'k2': [1, 1, 2, 3, 3, 4, 4]})

In [55]:
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [58]:
data[data.duplicated()]

    k1  k2
6  two   4

In [59]:
data.drop_duplicates()

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

In [60]:
 data['v1'] = range(7)

In [61]:
data

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
5  two   4   5
6  two   4   6

In [62]:
data.drop_duplicates(['k1'])

    k1  k2  v1
0  one   1   0
1  two   1   1

In [64]:
data.duplicated(['k1'])

0    False
1    False
2     True
3     True
4     True
5     True
6     True
dtype: bool

In [66]:
data.drop_duplicates(['k1','k2'], keep = 'last')

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
6  two   4   6

In [67]:
data = pd.DataFrame({'food': ['bacon', 'pulled pork', 'bacon','Pastrami', 'corned beef', 'Bacon',
'pastrami', 'honey ham', 'nova lox'],
'ounces': [4, 3, 12, 6, 7.5, 8, 3, 5, 6]})

In [68]:
data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     Pastrami     6.0
4  corned beef     7.5
5        Bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

In [69]:
meat_to_animal = {
'bacon': 'pig',
'pulled pork': 'pig',
'pastrami': 'cow',
'corned beef': 'cow',
'honey ham': 'pig',
'nova lox': 'salmon'
}

In [70]:
meat_to_animal

{'bacon': 'pig',
 'pulled pork': 'pig',
 'pastrami': 'cow',
 'corned beef': 'cow',
 'honey ham': 'pig',
 'nova lox': 'salmon'}

In [73]:
lowercased = data['food'].str.lower()

In [72]:
data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     Pastrami     6.0
4  corned beef     7.5
5        Bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

In [74]:
lowercased

0          bacon
1    pulled pork
2          bacon
3       pastrami
4    corned beef
5          bacon
6       pastrami
7      honey ham
8       nova lox
Name: food, dtype: object

In [76]:
data['animal'] = lowercased.map(meat_to_animal)

In [77]:
data

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     Pastrami     6.0     cow
4  corned beef     7.5     cow
5        Bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

In [79]:
data = pd.Series([1., -999., 2., -999., -1000., 3.])

In [80]:
data

0       1.0
1    -999.0
2       2.0
3    -999.0
4   -1000.0
5       3.0
dtype: float64

In [81]:
data.replace(-999,np.nan)

0       1.0
1       NaN
2       2.0
3       NaN
4   -1000.0
5       3.0
dtype: float64

In [82]:
data.replace([-999,-1000],np.nan)

0    1.0
1    NaN
2    2.0
3    NaN
4    NaN
5    3.0
dtype: float64

In [83]:
data.replace([-999,-1000],[4,5])

0    1.0
1    4.0
2    2.0
3    4.0
4    5.0
5    3.0
dtype: float64

In [84]:
data = pd.DataFrame(np.arange(12).reshape((3, 4)),
index=['Ohio', 'Colorado', 'New York'],
columns=['one', 'two', 'three', 'four'])

In [85]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

In [87]:
data.rename(index= str.lower, columns = str.upper)

          ONE  TWO  THREE  FOUR
ohio        0    1      2     3
colorado    4    5      6     7
new york    8    9     10    11

In [90]:
data.rename(index = {'Ohio' : 'karachi'}, columns = {'three' : 'peshawar'})

          one  two  peshawar  four
karachi     0    1         2     3
Colorado    4    5         6     7
New York    8    9        10    11

In [97]:
ages = [20, 22, 25, 27, 21, 23, 37, 31, 61, 45, 41, 32,18]

In [98]:
bins = [18, 25, 35, 60, 100]
# cats = pd.cut(ages, bins)

In [99]:
bins

[18, 25, 35, 60, 100]

In [100]:
cats = pd.cut(ages, bins)

In [101]:
cats

[(18, 25], (18, 25], (18, 25], (25, 35], (18, 25], ..., (60.0, 100.0], (35.0, 60.0], (35.0, 60.0], (25.0, 35.0], NaN]
Length: 13
Categories (4, interval[int64]): [(18, 25] < (25, 35] < (35, 60] < (60, 100]]

In [102]:
cats.codes

array([ 0,  0,  0,  1,  0,  0,  2,  1,  3,  2,  2,  1, -1], dtype=int8)

In [103]:
cats.categories

IntervalIndex([(18, 25], (25, 35], (35, 60], (60, 100]],
              closed='right',
              dtype='interval[int64]')

In [108]:
cats.dtype

CategoricalDtype(categories=[(18, 25], (25, 35], (35, 60], (60, 100]],
              ordered=True)

## Detecting and Filtering Outliers

In [4]:
import numpy as np
import pandas as pd
data = pd.DataFrame(np.random.randn(1000, 4))
data

            0         1         2         3
0   -0.680414 -0.399779 -0.242594 -0.366348
1    0.329260  1.186846  2.355416  0.276571
2    0.464316  1.329322  0.801841  0.329404
3    0.472005  0.104694 -0.282002 -1.076716
4    0.130328 -0.543850 -2.595826  0.470537
..        ...       ...       ...       ...
995 -0.255203 -0.555268  0.476245 -0.380062
996  1.808240 -0.540580 -0.589223 -0.856641
997  1.098510 -0.347604  0.449522  0.690420
998 -1.433845  0.545026 -1.609272 -0.469420
999 -0.940556 -1.155621  0.914407  1.576585

[1000 rows x 4 columns]

In [3]:
data.describe() # define the staistics of the data

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean     -0.022020     0.002100     0.059342    -0.010981
std       0.975678     1.002310     0.979954     1.003267
min      -2.739911    -2.835756    -3.172105    -3.273913
25%      -0.724171    -0.664640    -0.621981    -0.685061
50%      -0.048282     0.009291     0.025632     0.029457
75%       0.633292     0.680680     0.704522     0.657846
max       2.968984     3.238621     2.551026     3.035779

In [5]:
# Suppose you wanted to find values in one of the columns exceeding 3 in absolute
# value:
col = data[2] 
col[np.abs(col) > 3] # only column 2

230    3.085668
539   -3.116838
860    3.900673
Name: 2, dtype: float64

In [6]:
data[(np.abs(data) > 3).any(1)] # all coulmns

            0         1         2         3
160  0.620567  0.553274  0.573720  3.166706
230  0.354206 -1.383848  3.085668  0.329881
264 -1.055368  0.253625 -0.517448  3.101639
284 -4.679242  1.544679  0.289359 -0.685393
398 -3.879973  1.698636  0.308032 -0.691605
539 -0.384427  2.566195 -3.116838  0.781200
565 -1.579401  2.016617  1.777947  3.215446
588 -1.191237 -3.499617  1.716898 -0.239368
597  1.137522  3.083947  2.810839 -0.587500
692 -3.795010 -0.696935  0.060468  2.318432
849  3.295942 -0.287564 -1.274950 -0.034834
855 -3.861854 -0.252345  0.684587 -0.046279
860  0.479094 -0.834242  3.900673 -1.039838
920  0.051524 -3.385781  1.153596 -0.242262
953 -0.191164 -3.825457 -0.089062  0.532360

In [8]:
#Values can be set based on these criteria. Here is code to cap values outside the inter
# val 3 to 3:
data[np.abs(data) > 3] = np.sign(data) * 3
#np.sign(data) produces 1 and 1

In [9]:
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean     -0.031964    -0.070163     0.033916     0.007166
std       1.012379     0.999492     0.988510     0.977835
min      -3.000000    -3.000000    -3.000000    -2.386404
25%      -0.686820    -0.732778    -0.606822    -0.645328
50%      -0.031983    -0.077532     0.033980    -0.030303
75%       0.681342     0.593268     0.679499     0.679781
max       3.000000     3.000000     3.000000     3.000000

In [16]:
np.sign(data).head()

     0    1    2    3
0 -1.0 -1.0 -1.0 -1.0
1  1.0  1.0  1.0  1.0
2  1.0  1.0  1.0  1.0
3  1.0  1.0 -1.0 -1.0
4  1.0 -1.0 -1.0  1.0

## Permutation and Random Sampling

In [24]:
df = pd.DataFrame(np.arange(5 * 4).reshape((5, 4)))
df

    0   1   2   3
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15
4  16  17  18  19

In [25]:
sampler = np.random.permutation(5)
sampler #generate the array of integers in random sequence last number  not included

array([3, 4, 1, 2, 0])

In [26]:
# take function: take list of index and arrange data in the given manner
df = pd.DataFrame(np.arange(5 * 4).reshape((5, 4)))

df.take(sampler)

    0   1   2   3
3  12  13  14  15
4  16  17  18  19
1   4   5   6   7
2   8   9  10  11
0   0   1   2   3

In [27]:
# sample method on Series and DataFrame:give random subset of data
df.sample(n=3)

    0   1   2   3
0   0   1   2   3
1   4   5   6   7
4  16  17  18  19

## Computing Indicator/Dummy Variables

In [29]:
# Another type of transformation for statistical modeling or machine learning applica
# tions is converting a categorical variable into a dummy or indicator matrix.

# DataFrame with k columns containing all 1s and 0s.


# pandas has a get_dummies function for doing this,

df = pd.DataFrame({'key': ['b', 'b', 'a', 'c', 'a', 'b'],'data1': range(6)})

df

  key  data1
0   b      0
1   b      1
2   a      2
3   c      3
4   a      4
5   b      5

In [31]:
pd.get_dummies(df['key'])

   a  b  c
0  0  1  0
1  0  1  0
2  1  0  0
3  0  0  1
4  1  0  0
5  0  1  0

In [33]:
# In some cases, you may want to add a prefix to the columns in the indicator Data
# Frame, which can then be merged with the other data. get_dummies has a prefix argu
# ment for doing this:


dummies = pd.get_dummies(df['key'], prefix='key')
dummies

   key_a  key_b  key_c
0      0      1      0
1      0      1      0
2      1      0      0
3      0      0      1
4      1      0      0
5      0      1      0

In [35]:
df_with_dummy = df[['data1']].join(dummies)
df_with_dummy

   data1  key_a  key_b  key_c
0      0      0      1      0
1      1      0      1      0
2      2      1      0      0
3      3      0      0      1
4      4      1      0      0
5      5      0      1      0

## String Manipulation

In [39]:
# word searching,replacing etc


val = 'a,b, guido'
val.split(',') # get separate character or word and return list

['a', 'b', ' guido']

In [40]:
# to remove withespace and line breaks we use split with strip

pieces = [x.strip() for x in val.split(',')]
pieces

['a', 'b', 'guido']

In [42]:
first, second, third = pieces
first + '::' + second + '::' + third

'a::b::guido'

In [45]:
'::'.join(pieces) #replace delimiter

'a::b::guido'

### locating substrings.

In [46]:
'guido' in val

True

In [48]:
val = 'a,b, guido'
print(val)
val.index(',') #give the first index of subtring

a,b, guido

1

In [49]:
val.find(':')
# Note the difference between find and index is that index raises an exception if the
# string isnt found

-1

In [50]:
# count returns the number of occurrences of a particular substring:
val.count(',')

2

In [52]:
# replace will substitute occurrences of one pattern for another
val.replace(',', '::')

'a::b:: guido'

In [53]:
val.replace(',', '')

'ab guido'

## Regular Expressions

In [54]:
# Regular expressions (regex) provide a flexible way to search or match  complex string patterns in text
# Note:
# The art of writing regular expressions could be a chapter of its own
# and thus is outside the books scope.



# The regex describing one or more whitespace characters (tabs, spaces, and newlines).
# is \s+:
import re
text = "foo bar\t baz \tqux"
re.split('\s+', text)

['foo', 'bar', 'baz', 'qux']

In [55]:
text.split(' ')

['foo', 'bar\t', 'baz', '\tqux']

In [56]:
# When you call re.split('\s+', text), the regular expression is first compiled, and
# then its split method is called on the passed text

regex = re.compile('\s+')
regex.split(text)

['foo', 'bar', 'baz', 'qux']

In [57]:
# to get a list of all patterns matching the regex, you can use the
# findall method:

regex.findall(text)

[' ', '\t ', ' \t']

In [59]:
text = """Dave dave@google.com
Steve steve@gmail.com
Rob rob@gmail.com
Ryan ryan@yahoo.com
"""
pattern = r'[A-Z0-9._%+-]+@[A-Z0-9.-]+\.[A-Z]{2,4}'
regex = re.compile(pattern, flags=re.IGNORECASE)
# re.IGNORECASE makes the regex case-insensitive
regex = re.compile(pattern, flags=re.IGNORECASE)
regex.findall(text)

['dave@google.com', 'steve@gmail.com', 'rob@gmail.com', 'ryan@yahoo.com']

In [62]:

# findall returns all matches
# in a string, search returns only the first match. 

m = regex.search(text)
m

In [63]:
text[m.start():m.end()]

'dave@google.com'

In [64]:
# sub will return a new string with occurrences of the pattern replaced by the
# a new string:

print(regex.sub('REDACTED', text))

Dave REDACTED
Steve REDACTED
Rob REDACTED
Ryan REDACTED

In [66]:
# Suppose you wanted to find email addresses and simultaneously segment each
# address into its three components: username, domain name, and domain suffix.

pattern = r'([A-Z0-9._%+-]+)@([A-Z0-9.-]+)\.([A-Z]{2,4})'
regex = re.compile(pattern, flags=re.IGNORECASE)
# A match object produced by this modified regex returns a tuple of the pattern com
# ponents with its groups method:
m = regex.match('wesm@bright.net')
m

In [67]:
m.groups()

('wesm', 'bright', 'net')

In [68]:
regex.findall(text)

[('dave', 'google', 'com'),
 ('steve', 'gmail', 'com'),
 ('rob', 'gmail', 'com'),
 ('ryan', 'yahoo', 'com')]

In [69]:
print(regex.sub(r'Username: \1, Domain: \2, Suffix: \3', text))

Dave Username: dave, Domain: google, Suffix: com
Steve Username: steve, Domain: gmail, Suffix: com
Rob Username: rob, Domain: gmail, Suffix: com
Ryan Username: ryan, Domain: yahoo, Suffix: com

## Project

In [ ]:

#Project: code to extract phone numbers or e-mails from the given file and create two list (mail and phone number) 
# helping refrrence: Automate the Boring Stuff Using Python